In [19]:
import numpy as np
import pandas as pd

In [20]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))

In [21]:
ser

0    6
1    3
2    7
3    4
dtype: int32

In [22]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),columns=['a','b','c','d'])

In [23]:
df

   a  b  c  d
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [24]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [25]:
np.exp(df)

             a            b           c            d
0   403.428793  8103.083928    7.389056   403.428793
1  1096.633158    54.598150   20.085537  1096.633158
2  1096.633158     7.389056  148.413159    54.598150

In [26]:
np.sin(df*np.pi/4)

          a             b         c             d
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224606e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224606e-16

在使用np的通用函数的时候，保留了索引